**What is Pandas** <br> Open source library providing high performance, easy to use data structures and data analysis tools <br>
What is a DataFrame - Presents data in a grid/tabular format <br> 
What is a DataSeries <br>
Different operations in Pandas <br>

In [2]:
import pandas as pd
import numpy as np

While creating a dataframe <br> 3 things to remember: <br> Datasource & RowIndex & ColumnNames

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'], columns=['Col1','Col2','Col3','Col4'])

In [4]:
df

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [5]:
df.to_csv('test1.csv')

In [8]:
## Accessing the elements
## .loc(labels) & .iloc(index position)
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [9]:
type(df.loc['Row1'])

pandas.core.series.Series

Series is a dataframe with either one row or one column

In [16]:
#accessing multiple rows
df.loc[['Row2','Row3']]

      Col1  Col2  Col3  Col4
Row2     4     5     6     7
Row3     8     9    10    11

In [18]:
# accessing single column
df.loc[:,'Col1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Col1, dtype: int32

In [19]:
#accessing multiple columns
df.loc[:,['Col1','Col2']]

      Col1  Col2
Row1     0     1
Row2     4     5
Row3     8     9
Row4    12    13
Row5    16    17

In [21]:
#accessing a range of rows
df.loc['Row1':'Row3']

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11

In [22]:
#accessing a range of columns
df.loc[:,'Col1':'Col3']

      Col1  Col2  Col3
Row1     0     1     2
Row2     4     5     6
Row3     8     9    10
Row4    12    13    14
Row5    16    17    18

In [10]:
df.iloc[:,:]

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [12]:
df.iloc[0:3,0:2]

      Col1  Col2
Row1     0     1
Row2     4     5
Row3     8     9

In [13]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

**Convert DataFrame to Arrays**

In [23]:
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

**value_counts() is a very useful & widely used in EDA.**

In [26]:
# Shows the number of each value in a given column appears. 
# Also gives you the list of uniquie values and the number of times each value is present

df['Col1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Col1, dtype: int64

**Checking Null values**

In [28]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

**unique()**

In [30]:
#returns all unique values in that column, as an array. 
df.Col1.unique()

array([ 0,  4,  8, 12, 16])